# DuctSizeIterator Properties

---
The DuctSizeIterator type exposes the following members.
| Name| Description
---|---|---
| Current| Gets the item at the current position of the iterator.
| CurrentObject|
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace